Revit 2017 API
SiteLocation.PlaceName Property
The place name of the site.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 17.0.0.0 (17.0.484.0)
Since: 2013
Syntax
C#
public string PlaceName { get; set; }
Visual Basic
Public Property PlaceName As String
	Get
	Set
Visual C++
public:
property String^ PlaceName {
	String^ get ();
	void set (String^ value);
}
See Also
SiteLocation Class
Autodesk.Revit.DB Namespace